---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.Contains(Autodesk.Revit.DB.Electrical.Wire)
source: html/29f4ae65-c03f-b685-bf05-619acc90fe39.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.Contains Method

## Syntax (C#)
```csharp
public virtual bool Contains(
	Wire item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.Wire`)